performance/tests/apiKeys.yml
execution:
  - concurrency: 1
    hold-for: 2m
    scenario: api-key-create
  - concurrency: 1
    hold-for: 2m
    scenario: api-keys-get-all
  - concurrency: 1
    hold-for: 2m
    scenario: api-key-delete-one

scenarios:
  get-user-token:
    requests:
    - if: '${__javaScript(vars.get("access_token") == null)}'
      then:
        - url: ${__P(base-uri)}/api/oauth/token
          method: POST
          label: GetUserToken
          headers:
            Authorization: Basic ${__base64Encode(${__P(user-auth)})}
          body:
            grant_type: password
            username: ${__P(username)}
            password: ${__P(password)}
          extract-jsonpath:
            access_token:
              jsonpath: $.access_token
  api-key-create:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/apiKeys
        method: POST
        label: CreateApiKey
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
        extract-jsonpath:
          api_key_id: $.id
  api-key-delete-one:
    requests:
      - include-scenario: api-key-create
      - url: ${__P(base-uri)}/api/apiKeys/${api_key_id}
        method: DELETE
        label: DeleteApiKey
        headers:
          Authorization: Bearer ${access_token}
  api-keys-get-all:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/apiKeys
        method: GET
        label: GetAllApiKeys
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json

reporting:
    - module: passfail
      criteria:
        Create API Key too slow: p90 of CreateApiKey>500ms
        Delete API Key too slow: p90 of DeleteApiKey>500ms
        Get All API Key too slow: p90 of GetAllapiKeys>500ms